In [25]:
import pandas as pd 
from pathlib import Path

In [26]:
salary_df = pd.read_csv("Resources/salaries_1985to2018.csv")
salary_df.head()

,index,league,player_id,salary,season,season_end,season_start,team
0,0,NBA,abdelal01,395000,1990-91,1991,1990,Portland Trail Blazers
1,1,NBA,abdelal01,494000,1991-92,1992,1991,Portland Trail Blazers
2,2,NBA,abdelal01,500000,1992-93,1993,1992,Boston Celtics
3,3,NBA,abdelal01,805000,1993-94,1994,1993,Boston Celtics
4,4,NBA,abdelal01,650000,1994-95,1995,1994,Sacramento Kings

# Combining Player_id and Salary

In [27]:
total_salary = salary_df[['player_id', 'salary']]
total_salary.head()

   player_id  salary
0  abdelal01  395000
1  abdelal01  494000
2  abdelal01  500000
3  abdelal01  805000
4  abdelal01  650000

In [28]:
total_salary['Total Salary'] = total_salary.groupby(['player_id'])['salary'].transform(sum)
player_salary = total_salary.drop_duplicates(subset=['player_id'])[['player_id','Total Salary']]
player_salary

C:\Users\scott_p9qjqkt\AppData\Local\Temp\ipykernel_19700\1854512118.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  total_salary['Total Salary'] = total_salary.groupby(['player_id'])['salary'].transform(sum)

       player_id  Total Salary
0      abdelal01       2844000
5      abdulka01       8560000
9      abdulma02      19849500
18     abdulta01      37982800
28     abdursh01      95866000
...          ...           ...
14154  zidekge01       2081200
14157  zimmest01        950000
14158  zipsepa01       2062611
14160  zizican01       1645200
14161  zubaciv01       2347567

[2408 rows x 2 columns]

In [29]:
player_salary.dtypes

player_id       object
Total Salary     int64
dtype: object